app/controllers/hero_powers_controller.rb

SELECT "hero_powers".* FROM "hero_powers"
---
    def index
        @hero_powers = HeroPower.all

SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "hero_powers".* FROM "hero_powers" WHERE "hero_powers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @hero_power = HeroPower.find(params[:id])

INSERT INTO "hero_powers" ("hero_id", "power_id", "strength", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["hero_id", 1], ["power_id", 1], ["strength", "medium"], ["created_at", "2022-12-05 09:13:44.337311"], ["updated_at", "2022-12-05 09:13:44.337311"]]
---
    def create
        @hero_power = HeroPower.create!(heropower_params)