app/controllers/powers_controller.rb

SELECT "powers".* FROM "powers"
---
    def index
        @powers = Power.all

SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 100], ["LIMIT", 1]]
---
    def show
        @power = Power.find(params[:id])

SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "powers" SET "description" = ?, "updated_at" = ? WHERE "powers"."id" = ?  [["description", " The bitch has bitched bitchly! "], ["updated_at", "2022-12-05 08:47:49.199413"], ["id", 1]]
---
    def update
        @power = Power.find(params[:id])
        @power.update!(power_params)